<script setup lang="ts">
import BackgroundItems from '@/components/BackgroundItems.vue'
import BackgroundStars from '@/components/BackgroundStars.vue'
import TextItem from '@/components/TextItem.vue'
import Text from '@/components/Text.vue'
import Mech from '@/components/Mech.vue'
import Icons from '@/components/icons/Icons.vue'

const textItems = {
	sapis: {
		title: 'Cапиосексуал',
		description: [
			'Человек, который при выборе партнера отдает приоритет интеллектуальным качествам. Интеллектуальные беседы и споры с потенциальным партнером могут вызвать у сапиосексуала сексуальное возбуждение. Это может произойти даже при отсутствии эмоциональной близости',
			'При этом сам по себе высокий уровень IQ потенциального партнера — от 120 до 135, — важное, но далеко не самое привлекательное качество для сапиосексуалов. Им важнее то, каким образом этот интеллект проявляется, как человек его использует: есть ли у потенциального партнера потребность в познании окружающего мира, насколько он насмотрен и начитан',
			'Интеллект представляет собой потенциал, но именно творчество, вытекающее из потенциала, вызывает возбуждение',
		],
		image: 'sapisex.jpeg',
	},

	veselay: {
		title: 'Веселая',
		description: [
			'Синдром счастливой куклы — патология, характеризующаяся такими признаками, как частый смех или улыбки',
		],
		image: 'veselaya.jpg',
	},

	mazohistka: {
		title: 'Мазохистка',
		description: [
			'Зигмундом Фрейдом выделил женский мазохизм, который рассматривал в качестве выражения женской сущности. Фрейд указал на прочную связь между женственностью и сексуальной активностью. Он полагал, что налагаемое на женщину социальное подавление её агрессивности «способствует образованию сильных мазохистских побуждений»',
			'Хелен Дойч высказывала предположение, что быть женщиной — значит быть мазохистичной, и это является до известной степени явлением нормальным: процесс деторождения связан с получением мазохистского удовлетворения, материнство носит внутренне мазохистичный характер, менструация имеет скрытую мазохистскую подоплёку',
		],
		image: 'mazohistka.jpg',
	},

	sabmissiv: {
		title: 'Сабмиссив',
		description: [
			'до сих пор первая ассоциация, когда речь идет о ДС, складывается у обывателей такая: грозная Госпожа неистово материт и унижает своего Раба, который сидит в клетке второй месяц. Ему сыро, грязно и очень гнусно от самого себя',
			'А Госпожа с монобровью демонически хохочет и примеряет новый и новый дилдо',
		],
		image: 'seans.jpg',
	},
}
</script>

<template>
	<div class="min-h-screen min-w-full relative py-6 caveat-400">
		<BackgroundStars class="z-0" />
		<BackgroundItems class="z-10" />

		<h1 class="text-gradient text-[5rem] text-center caveat-400 z-20 relative">
			Веселая мазохистка
		</h1>

		<div class="py-16 container mx-auto grid grid-cols-12 gap-12 z-20 relative">
			<Icons
				class="col-span-4"
				:icons="['pletka', 'posotionSverhu', 'plag', 'trusiki']"
			/>
			<Text
				header="Аксиома"
				class="col-span-8"
			>
				<p>
					Привет, красавчик) Я буду звать тебя красавчик - ты не против?
					Конечно, это может оказаться совсем не так, - свидание вслепую вещь
					такая, - но я оптимистка. Думаю, оптимизм неизбежное следствие ума, а
					я умная девочка - умная девочка с длинными ногами. Хитрая, стройная,
					имею свой взгляд и умею его отстаивать. Еще я люблю сзади и погрубее -
					и это тебе понравилось бы еще больше, но ты сегодня вряд ли об этом
					узнаешь((
				</p>
				<p>
					У нас назначено свидание, но я освободилась пораньше и пришла в бар
					выпить пару бокалов дорогого светлого и расслабиться с листом толстой
					чуть желтоватой бумаги, шариковой ручкой с тонким письмом и своими
					мрачными после рабочей недели мыслями<br />
					Не помню когда я полюбила писать? Всегда любила, наверное. Но только
					не для других - нет. Для себя. Чтобы знать кто я. Чтобы не сойти с
					ума. Ну или хотя бы узнать первой, когда это произойдет
				</p>
				<p>
					Я родилась рано - в 4 утра, а сформировалась поздно - в 18 одела свой
					первый лифчик. У меня круглая аккуратная попка, красивые ноги и я
					всегда любила носить короткие шортики - так что проблем с мужчинами у
					меня никогда не было. Мама хотела назвать меня Аней, а папа Катей.
					Чтобы не ссориться меня назвали Ольгой - ненавижу компромиссы
				</p>
				<p>
					Что еще? Я веселая. И я мазохистка. И, если бы наше общество не
					состояло из сранных лицемеров я бы так и представлялась
				</p>

				<ul>
					<li>
						- Привет, я веселая мазохистка. Я люблю пешие прогулки, старую
						литературу и когда мужчина умнее меня. Люблю красивые ухаживания,
						люблю когда меня любят и люблю любить
					</li>
				</ul>

				<p>
					Наверное, все как и всех. Ну может, кроме мазохистки. Хотя Фрейд
					писал, что все женщины мазохистки - я этого не замечала. Порой мне
					кажется что на всем белом свете я одна такая. Что мне одной надо
					побольнее и слегка поплакать, прежде чем кончить. Что я одна отпуская
					свои тревоги при помощи плетки и пару тугих клипс. Хотя может другие
					женщины просто не кончают. Может они никогда и не отпускают свои
					мысли? Живут себе в своем полумире и обслуживают своих мужчин своими
					телами душами и чувствами, забывая о себе и том что и их Бог наделил и
					свободой и волей и стремлением к счастью<br />
					Терпеть не могу, когда кто-то жертвует собой. Не в бою и не ради
					чего-то, а просто так. Лишь бы не думать. Лишь бы не рисковать<br />
					К черту полумеры. К черту сопливые договорняки. Любить, так до конца.
					Плакать, так чтобы навзрыд. Ненавидеть, так со всей душой. Трахаться,
					так до потери сознания
				</p>
				<p>А потом еще разок</p>
			</Text>

			<Text
				header="Больше"
				class="col-span-8"
			>
				<p>
					Я не всегда была мазохисткой. Когда-то в самом начале мне хватало
					нежных объятий, быстрый неритмичных фрикций и того, что все
					закончилось и можно отчитаться о том, что секс был. И я не страдала от
					этого. Но в какой-то момент я поняла, что мне нужно больше. Когда
					же... когда же это началось?
				</p>
				<p>
					Наверное, сразу после института. Я тогда встречалась со своим первым
					настоящим парнем. Конечно, парни у меня были и до, но, какие-то они
					все были ненастоящие, мимолетные: потрахаться, поболтать, да сходить
					на пару свиданий - не больше. А этот прям настоящий: квартира,
					совместные планы, знакомство с родителями, любовь, общие привычки -
					все серъезно. В целом неплохой парень. Прикольный, легкий,
					эрудированный, но задрот. Оно в общем-то и ничего, почти не мешало. Он
					был веселый смешной, с ним было не очень легко, но и не слишком
					тяжело, часто забавно - он был почти идеал, если так подумать. Но как
					же... как же с ним было утомительно трахаться
				</p>

				<ul>
					<li>
						- С тобой очень утомительно трахаться, - так и сказала ему я, когда
						решила закончить все это
					</li>
					<li>- Что?</li>
					<li>
						- Мы не подходим друг другу! - продолжила я решительно. - В
						сексуальном плане...
					</li>
				</ul>

				<p>
					Задрот ничего не понимал и смотрел на меня своими задротскими глазами
					(а ведь, когда-то они мне так нравились). Я решила, что надо как-то
					объясниться
				</p>

				<ul>
					<li>
						- Ты заботливый ласковый, даже больше чем мне нужно. И в общем-то
						делаешь все что я хочу, но ты почти ничего не хочешь сам...
					</li>
					<li>- Чего я не хочу?!</li>
					<li>
						- Ты или не перебивай, или не спрашивай, - оборвала я его в ответ,
						но тут же пожалела об этом. В конце концов, это я давно планировала
						этот разрыв, а для него это было сюрпризом. Когда тебя бросают это
						ведь почти всегда неожиданно. - Просто тебе нужно меньше чем мне
					</li>
				</ul>

				<p>Он явно меня не понимал</p>

				<ul>
					<li>
						- Сильно меньше, - сказала я с нажимом, пытаясь донести свою мысль
					</li>
				</ul>

				<p>
					Господи, эти мужчины. Живут здесь и сейчас и думают, что все остальные
					живут также. Мужская жизнь - лишь желание. Хочу, хочу, хочу. Но мы то
					женщины тонкое вытянутое надо: от наших матерей до детей и дальше,
					дальше... все время дальше
				</p>

				<ul>
					<li>
						- Мне ведь уже не 20, милый, чтобы жить одним днем. Я должна думать
						и о завтра
					</li>
					<li>- Ты не получаешь со мной удовольствия?</li>
					<li>- Нет, мне достаточно приятно</li>
					<li>- Тогда я тебя не понимаю</li>
					<li>
						- Ты доставляешь мне удовольствие, но тебе это не нравится. Ты
						думаешь только обо мне и игнорируешь свои желания
					</li>
				</ul>

				<p>
					Наверное, это кажется нелогичным. Многие бы сказали это так прикольно,
					что он делает все что ты хочешь. Но я то умная девочка - я уже
					говорила, - я не верю в такие отношения. Неважно где: в бизнесе, в
					дружбе, в сексе и уж тем более в браке. Не бывает такого, что кому-то
					хорошо, а другой терпит, терпит бесконечно (если он, конечно, не
					идиот, а зачем тебе быть в отношениях с идиотом?). Внутри все равно
					копится. И копится. И копится. И копится. И копится. А потом БАМ! Не
					знаю, почему это произошло. У нас все было так хорошо
				</p>
			</Text>

			<TextItem
				:item="textItems.mazohistka"
				class="col-span-4"
			/>

			<Icons
				class="col-span-4"
				:icons="['banan', 'ass', 'mask']"
			/>

			<Text class="col-span-8">
				<ul>
					<li>
						- Я могу стараться меньше, - с сомнением предложил Задрот после
						минуты размышлений
					</li>
				</ul>

				<p>
					Я промолчала, а он, наслушавшись моего молчания, с обидой проговорил:
				</p>

				<ul>
					<li>
						- Но ты никогда мне ничего не говорила. Я ни о чем даже не
						догадывался
					</li>
				</ul>

				<p>
					В целом и прочем он был конечно прав. Я никогда ничего ему не
					говорила. Не хотела говорить. Да и расставаться не хотела. Уж больно
					он был надежный и влюбленный в меня (а мне это в мужчинах пиздец как
					нравится), чтобы его вот так легко бросить. Но видит бог этот мир и
					без того состоит из лишь одной несправедливости, чтобы множить ее без
					дела
				</p>

				<ul>
					<li>
						- Прости, - сказала я, закрывая за ним дверь. - Не обижайся, но так
						будет лучше
					</li>
				</ul>

				<p>
					Тошно. Мне было тошно и обидно. Мутило, что пришлось быть такой сукой.
					Мутило, что пришлось ранить очень хорошего парня. На самом деле очень
					хорошего. Но лучше сейчас, чем через 5 лет и лучше обидеть, чем давать
					обижать себя, ведь обижая себя ты совершаешь сразу два греха:
					совершаешь насилие над собой и мажешь этим насилием того, кому ты это
					позволяешь
				</p>

				<ul>
					<li>
						- Нет, милая, - сказала я себе, уже много позже перед зеркалом. - Ты
						все сделала правильно!!!
					</li>
				</ul>

				<p>
					Я и до сих пор так считаю: я все тогда сделала правильно. Я еще не
					знала чего я хочу и останься с ним - так бы и не узнала. А может и
					вовсе бы перестала хотеть. Стала бы такой же холодной как он. Или даже
					хуже - просто никакой. Не теплой, не горячей, просто комнатной
					температуры. Бррр. До сих пор страшно
				</p>
				<p>
					Бог уберег<br />
					Не иначе
				</p>
			</Text>

			<Text
				header="Меньше"
				class="col-span-8"
			>
				<p>
					Впрочем, я и тогда еще не была мазохисткой. Я уже чувствовала, что мне
					нужно что-то большее, что-то более тонкое изощренное. Или наоборот:
					более грубое, властное. Мне то порой хотелось стоять перед мужчиной на
					коленях, то, чтобы он стоял на коленях передо мной. Я не могла
					различить эти желания. Мне казалось, что это почти одно и тоже.
					Определилась я наверное только после Секси
				</p>
				<p>
					Это было уже много позже Задрота. Я тогда работала в Сити и часто по
					пятницам зависала с подругами в одном клубе. Он подкатил ко мне - весь
					такой высокий, наглый, слегка небритый. Не мудрил, даже не
					притворялся: почти в первом предложении предложил поехать к нему и не
					тратить время на все эти бессмысленные танцы
				</p>
				<p>
					Я его, конечно, послала. Нооо... не так то легко его было послать - уж
					больно он был настойчивый. Именно настойчивый, а не надоедливый.
					Надоедливого я бы сразу отшила, но он таким не был. Даже наоборот. Он
					добивался меня две недели, выслушал 1000 нет и все же... И все же вел
					он. а не я, и я знала: одно лишнее слово и я его потеряю. Это
					возбуждало. Такой незатейливый, бесхитростный, весь такой типо
					простой, но сексуальный и самодостаточный. Такого и не удержишь и не
					отпустишь
				</p>
				<p>
					Секси был ментом. Ментов я не уважаю, потому и отшивала его поначалу.
					Но оказалось, что он их тоже не уважал
				</p>

				<ul>
					<li>
						- И хер ли ты тогда мент? - спросила я его как-то вечером, пока он,
						развалившись на моем диване, пил кофе и по-хозяйски лапал мою
						задницу
					</li>
					<li>
						- Интересно ты рассуждаешь, - ответил он мне, отставив чашку в
						сторону, и расстегнув освободившейся рукой мою блузку. - А кем я
						должен быть?
					</li>
					<li>- Юристом</li>
					<li>- Не люблю буквоедов</li>
					<li>- Бухгалтером</li>
					<li>- Как твой бывший?</li>
					<li>- Доставщиком</li>
					<li>- Нет уж, спасибо</li>
					<li>- Продажником</li>
				</ul>

				<p>
					На это он даже и отвечать не стал. Торгашей мы с ним презирали
					одинаково
				</p>

				<ul>
					<li>
						- В программисты бы пошел, - не сдавалась я, но довести беседу до
						конца мне не удалось. Секси взял с тумбочки прищепки для сосков и
						нацепил их на меня, одновременно уволакивая мою голову вниз
					</li>
				</ul>

				<p>Господи, как же мне нравилось, когда он со мной так обращался</p>
			</Text>

			<TextItem
				:item="textItems.sabmissiv"
				class="col-span-4"
			/>

			<Icons
				class="col-span-4"
				:icons="['naruch', 'busy', 'klyap', 'dildo', 'gandon']"
			/>

			<Text
				header="###"
				class="col-span-8"
			>
				<ul>
					<li>
						- Нам нужно расстаться! - сказала я ему через полгода этого
						охуительного почти бесконечного секса
					</li>
					<li>- Не дури, - с ленцой протянул он и стал меня обнимать</li>
				</ul>

				<p>
					Я пнула его по колену, чем повредила себе больше чем ему, но он хотя
					бы обратил на меня внимания. Секси отодвинулся от меня и оглядел своим
					обычным мутным взглядом (я так и не поняла, со зрением у него было
					чего или он просто был заторможенным)
				</p>

				<ul>
					<li>- А ведь это не шутка, - сказал он. - Ты серьезно</li>
					<li>- Это не шутка, - согласилась с ним я. - Я серьезно!</li>
					<li>- Но что тебя не устраивает? У нас же все замечательно</li>
					<li>
						- У нас ничего нет замечательного. Кроме секса. Вообще ничего нет
						кроме секса, ни плохого, ни хорошего. И ты меня не уважаешь!
					</li>
					<li>- Ты и сама себя не уважаешь</li>
				</ul>

				<p>
					Это была правда. Я себя не уважала. Я себя любила, но не уважала. Я
					была умная, симпатичная, умела за себя постоять и твердо знала, что я
					стою уважения. Но я себя не уважала
				</p>

				<ul>
					<li>- Это другое?</li>
					<li>- Почему это</li>
					<li>
						- Мне можно. И потом я так хочу и мне еще не 40, чтобы наступать на
						свои желания
					</li>
				</ul>

				<p>
					Он потеребил свой подбородок, и окинул мою фигуру глазами. Видимо
					оценивал, стою ли я того, чтобы меня удерживать
				</p>

				<ul>
					<li>- Ну хорошо, я буду тебя уважать, - выдал он наконец</li>
					<li>- Нет, не будешь</li>
					<li>- Нет, не буду</li>
					<li>- Спасибо за честность</li>
					<li>- Я тебе никогда не врал</li>
				</ul>

				<p>
					Это была правда. Секси мне никогда не врал. И никогда не притворялся
					тем, кем не был. Он всегда был гондоном, но гондоном честным
				</p>

				<ul>
					<li>- Я хочу, чтобы ты ушел!</li>
					<li>- Это моя квартира</li>
					<li>- Это съемная квартира</li>
					<li>- Ее снял я</li>
					<li>- Да ее снял ты, но я хочу, чтобы ты ушел</li>
					<li>- А я хочу, чтобы ты мне отсосала</li>
				</ul>

				<p>Я раскрыла рот и не поверила тому что услышала</p>

				<ul>
					<li>
						- Если хочешь, чтобы я молча ушел, а не трахал тебе мозг тем какого
						хера ты хочешь расстаться - отсоси мне в последний раз, - сказал он
						улыбаясь. - А что такого? Вчера же ты это сделала. И сегодня утром.
						И я не помню, чтобы ты жаловалась. Готов поклясться, что тебе даже
						понравилось
					</li>
				</ul>

				<p>
					Он правда это сказал. Я была вне себя от ярости... Слава богу он
					ничего не сказал, когда уходил. Но говорить и не нужно было. Я все
					знала сама
				</p>
				<p>Гондон!!!</p>
			</Text>
			<Text
				header="Равно"
				class="col-span-8"
			>
				<p>
					Но и после этого я еще не была мазохисткой. Просто со мной плохо
					обращались. Точнее я позволила плохо с собой обращаться. Но временами
					мне нравилось. Мне нравился секс. Грубый, слегка болезненный,
					неконтролируемый... Приятно было отдаваться чужой власти. Вообще с
					Секси было очень круто спать. Не круто было просыпаться
				</p>
				<p>
					Мне почти никогда не нравилось с кем-то просыпаться. Наверное только с
					одним. Его звали Андрей. Андрей был серьезный, сдержанный, рослый,
					хоть и не высокий, умный, хоть и не слишком, заботливый, но не
					постоянно. Мы работали с ним вместе 2 года и даже почти не
					разговаривали. А потом встретились случайно на улице. Как дела? Что
					нового? Как там Наташка? Сначала пообедали, потом еще раз, потом
					поужинали - и оно завертелось
				</p>
				<p>
					Андрей был классным. Реально классным. Мы хорошо ладили. Мне нравилось
					с ним ложиться, нравилось с ним вставать. Я с радостью уходила на
					работу, с еще большей радостью возвращалась. Я готовила, кормила его,
					я наполняла его жизнь, а он наполнял мою. Я наслаждалась его телом и
					наслаждалась тем, как он наслаждается моим
				</p>
				<p>
					Каждую пятницу, как ритуал, связывал меня, закрывал глаза повязкой и
					мучал по многу часов. Не в смысле плетка и все такое, - хотя и с
					плеткой бывало, - нет: он покусывал мое тело и топил на мне кубики
					льда. Шептал мне о том, как он меня любит и обзывал грязной сукой,
					задрав мой ноги до самого подбородка. Ласково водил пером по моим
					соскам, а после (или до) трахал меня в горло, пока я не просила его
					остановиться
				</p>
				<p>Потом начинал все снова</p>
				<p>Потом снова</p>
				<p>
					По субботам мы ездили в парк или за город на рыбалку. Я не любила
					рыбачить, но с ним я бы и на край света уехала. Он смеялся и смешил
					меня, называл меня любимой и дурочкой. Впрочем, я и была любимой
					дурочкой рядом с ним. Счастливой дурочкой, которая нашла наконец свое
					равновесие. Идеальным баланс между желаниями двух людей. Между их
					страстями и тайным почти неслышным шепотом в их душе
				</p>

				<ul>
					<li>
						- Нам нужно расстаться, - сказал он мне как-то после субботнего
						обеда
					</li>
				</ul>

				<p>
					Не вечером, не на прогулке, не после ссоры и не после ужина - после
					обеда, и даже совсем не после - во время. Он ел голубцы, рассказывал о
					том, что было на работе и поглядывал в телевизор, на котором шел
					какой-то старый сериал
				</p>

				<ul>
					<li>
						- Нам нужно расстаться, - сказал он, откладывая вилку, и еще не
						дожевав до конца...
					</li>
				</ul>

				<p>
					А дальше я не помню. Нет, помню, но не хочу. Он что-то говорил. О том,
					что хочет большего или не того. Или того, но нового. А я бы и рада
					сказать, что восприняла все сдержанно и спокойно, но это было не так.
					Я плакала. Я кричала. Я разбила все до чего смогла дотянуться, и
					поцарапала ему все, что он мне позволил поцарапать
				</p>

				<ul>
					<li>- Прости, - сказал он, уходя. - но так будет лучше</li>
				</ul>
			</Text>

			<TextItem
				:item="textItems.sapis"
				class="col-span-4"
			/>

			<div class="col-span-12 grid gap-12">
				<Icons
					horizontal
					small
					:icons="['penis1', 'penis2', 'penis3']"
				/>

				<Text>
					<p>Кому?</p>
				</Text>
			</div>

			<TextItem
				:item="textItems.veselay"
				class="col-span-4 row-span-2"
			/>

			<Text
				header="Бедный Йорик"
				class="col-span-8"
			>
				<p>
					Вот где-то после этого я и поняла чего я хочу. Чего я хочу, не потому
					что так хочет он или я с ним, - кем бы он не был, - а чего хочу я. Я
					хотела смеха и легкости, умных бесед и веселых прогулок, честности и
					открытости. Чтобы я хотела того чего хочет он, а ему было по кайфу
					делать так как хочу я. Хочу каждую пятницу и каждый раз, когда будет
					по приколу. Хочу подолгу и медленно, когда хочется подолгу и медленно
					и быстро и спонтанно, когда хочется быстро и спонтанно
				</p>
				<p>
					Хочу чтобы он не боялся сказать чего он хочет, а я хотела услышать это
					как можно скорее, чтобы это сделать Хочу чтобы он хотел того же<br />
					Хочу чтобы он любил меня и, любя доводил меня до предела, когда я уже
					больше не могу. Хочу, чтобы было приятно и больно и эта боль делала
					удовольствие ярче, дольше, позже. Хочу любить. Хочу быть любимой
				</p>
				<p>
					Я назвала это свое новое состояние веселым мазохизмом. И дело даже не
					в том, что пока я чувствую боль - я жива и прочей чуши. Мне просто
					нравится смеяться. Смеяться и жить без кислой рожи
				</p>
				<p>
					Я все еще верю любовь и все еще ее ищу. Но не вижу смысла сидеть
					взаперти и пялится в окно: а вон, вон мой принц идет, или нет, этот,
					этот мой принц - найдет меня, когда будет надо. Ну или я его. А
					пока...
				</p>

				<ul>
					<li>
						- Привет, красавчик, - говорю я симпатичным парням (или не очень,
						лишь бы не уродам) и отвожу их к себе
					</li>
				</ul>

				<p>
					Так удобнее. Так проще. Да и смотреть как они убегают с утра, собирая
					свои вещи по незнакомой квартире приятнее и легче, чем самой убегать с
					утра, собирая свои вещи по незнакомой квартире
				</p>
				<p>
					Я думаю так: лучше не быть счастливой в одиночестве, чем быть
					несчастной с кем-то. А еще я думаю, что пиво уже полчаса как
					кончилось, а ты уже почти опаздываешь. Охренел?
				</p>
			</Text>

			<Mech class="col-span-12" />
		</div>
	</div>
</template>
